{
    "home" : {
        "presentation" : {
            "title" : "Hi! I'm ",
            "caption" : "",
            "description" : "Web developer passionate about innovation. Always exploring new tech and trends to deliver cutting-edge products.",
            "cvbtn" : "View more"
        },
        "skills" : {
            "titleskills" : "Skills",
            "descriptionskills" : "I have experience and skills in various technologies and programming languages."
        },
        "cookies" : {
            "title" : "This website uses cookies.",
            "description" : "To improve your experience this website use cookies.",
            "btn" : "Ok, got it!"
        },
        "backtopbtn" : "Back to the top"
    },
    "aboutme" : {
        "sub" : "TSU. IN INFORMATION TECHNOLOGIES",
        "info" : "Web developer passionate about creating applications that are useful, attractive and innovative. Always exploring new technologies and trends to offer products that are at the forefront of innovation on the web. Proactive, organized developer with the ability to work as a team,",
        "worktitle" : "Work experience",
        "workcaption" : "Assistant",
        "workdescription" : "Customer Service: Provide friendly and efficient customer service, resolving customer doubts and queries. Product organization: Keep products on shelves in an orderly manner and accessible to customers. Communication and customer service skills: Ability to communicate effectively with customers, resolving their doubts and queries in a friendly and efficient manner. Organization and planning skills: Ability to organize and plan work efficiently.",
        "educationtitle" : "Education",
        "ing" : "Software Development and Management Eng.",
        "tsu" : "HT. in Information Technologies",
        "cpt" : "Training for computer work",
        "skillstitle" : "Skills",
        "subskills" : "Assertive Communication, Problem Solving, Teamwork, Self-taught",
        "language" : "English (B1), Spanish (Native)",
        "downloadcv" : "Download CV",
        "backtocontact": "Go to contact page"
    },
    "projects" : {
        "title" : "Projects",
        "subtitle" : "Here you can see some of the projects I have created.",
        "pbtn" : "Go",
        "sbtn" : "View"
    },
    "projectsdetails" : {
        "about" : "About",
        "technologies" : "Technologies",
        "website" : "Website",
        "repo" : "GitHub"
    },
    "blog" : {
        "title" : "Blog",
        "postprev" : {
            "date" : "April 08, 2024",
            "title" : "How to center an element in CSS",
            "category" : "CSS",
            "subject" : "Centering an element in CSS does not have to be difficult, let's see the ways in which we can achieve it",
            "btn" : "Read more"
        }
    },
    "contact" : {
        "title" : "Contact",
        "subtitle": "Lets get in touch, send me an email",
        "divider" : "Or",
        "complementarytext": "Check more info",
        "linktext": "About Me",
        "form":{
            "name" : "Name",
            "helpname" : "Name is required",
            "email" : "Email",
            "helpemail" : "Email is required",
            "helpemailtype" : "Email must be a valid email",
            "message" : "Message",
            "pbtn" : "Submit",
            "sbtn" : "Reset"
        },
        "alert" : {
            "success" : "Message sent successfully",
            "error" : "Oops, there was an error sending the message"
        }
    },
    "error" : {
        "title" : "There is nothing in this place.",
        "btn" : "Back to home"
    },
    "workon" : {
        "title" : "I'm working on it"
    },
    "navbar" : {
        "items" : {
            "home" : "Home",
            "blog" : "Blog",
            "contact" : "Contact"
        },
        "bbtn" : "Go home",
        "darkthemetext" : "Turn on the light",
        "lightthemetext" : "Turn off the light"
    },
    "footer" : {
        "links" : {
            "about" : "About Me",
            "blog" : "Blog",
            "contact" : "Contact"
        },
        "language" : {
            "title" : "Language",
            "en" : "English",
            "es" : "Spanish"
        },
        "copy" : "All rights reserved.",
        "alert" : "Language changed succesfully"
    },
    "projectsdata":{
        "project01" : {
            "title" : "Corazon Huasteco",
            "date" : "Dec 01, 2023",
            "shortdescription" : "Website for the preservation of culture.",
            "largedescription" : "Corazón Huasteco is a project developed as part of the Software Development and Management Engineering program at the Technological University of Huasteca Hidalguense (UTHH). \n The main objective of this project is to preserve the rich culture of Huejutla de Reyes, Hidalgo, through a website hosting interesting articles that are accessible to everyone. \n It was developed collaboratively, involving the application of various technologies, some of which are detailed in the technologies section. \n Additionally, Corazón Huasteco has a direct relationship with a potential client, allowing the integration of practical experience in project development and management administration."
        },
        "project02" : {
            "title" : "App CAIH",
            "date" : "Aug 15, 2022",
            "shortdescription" : "Website for college of architects.",
            "largedescription" : "CAIH Application is a project developed as part of the internship requirement for my Associate Degree in Information Technology. \n I worked collaboratively with two other individuals, serving as a designer and documentation manager. \n The main objective was to update a platform for the Architects and Engineers Association (CAIH), migrating the original idea created with HTML, CSS, and JavaScript to an environment utilizing frameworks, libraries, and cloud services."
        },
        "project03" : {
            "title" : "Dulce Delicia",
            "date" : "Nov 28, 2023",
            "shortdescription" : "Sweet shop themed website.",
            "largedescription" : "Dulce Delicia is a project developed as an individual practice to explore technologies related to PWAs (Progressive Web Applications), including Service Workers, manifest files, notifications, and offline access. \n It was inspired by an existing website called 'Azucar Dulcerias' to structure elements and content."
        },
        "project04" : {
            "title" : "Fashion Fusion",
            "date" : "Aug 15, 2023",
            "shortdescription" : "Clothing store themed website.",
            "largedescription" : "Fashion Fusion is a project developed collaboratively to practice continuous improvement of DevOps and version control system using Git and GitHub. \n The website has a clothing store theme, and all content was added in less than a week, following techniques such as those mentioned."
        }
    }
}