{
    "home" : {
        "presentation" : {
            "title" : "Hey! Soy ",
            "caption" : "",
            "description" : "Desarrollador web apasionado por la innovación. Siempre explorando nuevas tecnologías y tendencias para ofrecer productos de vanguardia.",
            "cvbtn" : "Ver mas"
        },
        "skills" : {
            "titleskills" : "Habilidades",
            "descriptionskills" : "Tengo experiencia y habilidades en diversas tecnologías y lenguajes de programación.",
            "web" : "Desarrollo web",
            "pro" : "Lenguajes de Programación",
            "frame" : "Frameworks y librerias",
            "data" : "Bases de datos",
            "titlelanguages" : "Idiomas",
            "descriptionlanguages" : "Tengo conocimientos de los siguientes idiomas.",
            "en" : "Inglés",
            "fr" : "Francés",
            "es" : "Español"
        },
        "backtopbtn" : "Volver arriba",
        "cookies" : {
            "title" : "Este sitio web utiliza cookies.",
            "description" : "Para mejorar tu experiencia este sitio web utiliza cookies.",
            "btn" : "De acuerdo"
        }
    },
    "aboutme" : {
        "sub" : "TSU. EN TECNOLOGÍAS DE LA INFORMACIÓN",
        "info" : "Desarrollador web apasionado por crear aplicaciones que sean útiles, atractivas e innovadoras. Siempre explorando nuevas tecnologías y tendencias para ofrecer productos que estén a la vanguardia de la innovación en la web. Desarrollador proactivo, organizado y con capacidad de trabajo en equipo,",
        "worktitle" : "Experiencia Laboral",
        "workcaption" : "Auxiliar",
        "workdescription" : "Atención al cliente: Brindar un servicio de atención al cliente amable y eficiente, resolviendo las dudas y consultas de los clientes. Organización de productos:Mantener los productos en los estantes de manera ordenada y accesible para los clientes. Habilidades de comunicación y atención al cliente:Capacidad para comunicarse de forma efectiva con los clientes, resolviendo sus dudas y consultas de forma amable y eficiente. Habilidades de organización y planificación:Capacidad para organizar y planificar el trabajo de manera eficiente.",
        "educationtitle" : "Educación",
        "ing" : "Ing. en Desarrollo y Gestión de Software",
        "tsu" : "TSU. en Tecnologías de la información",
        "cpt" : "Capacitación para el trabajo en informatica",
        "skillstitle" : "Habilidades",
        "subskills" : "Comunicación Asertiva, Resolución de Problemas, Trabajo en Equipo, Autodidacta",
        "language" : "Inglés (intermedio), Español (nativo)",
        "downloadcv" : "Descargar CV",
        "backtocontact": "Ir a la página de contacto"
    },
    "projects" : {
        "title" : "Proyectos",
        "subtitle" : "Aquí puedes ver algunos de los proyectos que he creado.",
        "pbtn" : "Ir",
        "sbtn" : "Ver"
    },
    "projectsdetails" : {
        "about" : "Acerca de",
        "technologies" : "Tecnologías",
        "website" : "Sitio web",
        "repo" : "Repositorio"
    },
    "blog" : {
        "title" : "Blog",
        "postPrev" : {
            "date" : "08 de Abril de 2024",
            "title" : "Como centrar un elemento con CSS",
            "category" : "CSS",
            "subject" : "Centrar un elemento en CSS no tiene porque ser dificil, hechemos un vistazo a las diversas formas de como lograrlo",
            "btn" : "Leer más"
        }
    },
    "contact" : {
        "title" : "Contacto",
        "subtitle": "Pongamonos en contacto, enviame un correo electrónico",
        "divider" : "O",
        "complementarytext": "Mira más información",
        "linktext": "Sobre Mi",
        "form" : {
            "name" : "Nombre",
            "helpname" : "El nombre es obligatorio",
            "email" : "Correo electrónico",
            "helpemail" : "El correo es obligatorio",
            "helpemailtype" : "El correo debe ser un correo electrónico valido",
            "message" : "Mensaje",
            "pbtn" : "Enviar",
            "sbtn" : "Limpiar"
        },
        "alert" : {
            "success" : "Mensaje enviado correctamente",
            "error" : "Oops, hubo un problema enviando el mensaje"
        }
    },
    "error" : {
        "title" : "No hay nada en este lugar.",
        "btn" : "Volver al inicio"
    },
    "workon" : {
        "title" : "En fase de desarrollo"
    },
    "navbar" : {
        "items" : {
            "home" : "Inicio",
            "blog" : "Blog",
            "contact" : "Contacto"
        },
        "bbtn" : "Volver al inicio",
        "darkThemeText" : "Enciende la luz",
        "lightThemeText" : "Apaga la luz"
    },
    "footer" : {
        "links" : {
            "about" : "Sobre Mi",
            "blog" : "Blog",
            "contact" : "Contacto"
        },
        "language" : {
            "title" : "Idioma",
            "en" : "Inglés",
            "es" : "Español"
        },
        "copy" : "Todos los derechos reservados.",
        "alert" : "Idioma cambiado correctamente"
    },
    "projectsdata":{
        "project01" : {
            "title" : "Corazón Huasteco",
            "date" : "01 de Diciembre de 2023",
            "shortdescription" : "Sitio web para la preservación de la cultura.",
            "largedescription" : "Corazón Huasteco es un proyecto desarrollado como parte del programa de Ingeniería en Desarrollo y Gestión de Software en la Universidad Tecnológica de la Huasteca Hidalguense (UTHH). \n Este proyecto tiene como objetivo principal preservar la rica cultura de Huejutla de Reyes, Hidalgo, a través de un sitio web que aloje artículos interesantes y sea accesible para todos. \n Fue desarrollado en equipo, como parte de un esfuerzo colaborativo que involucró la aplicación de diversas tecnologías, algunas de las cuales se detallan en la sección de tecnologías. \n Además, Corazón Huasteco tiene una relación directa con un cliente potencial, lo que permitió integrar la experiencia práctica en el desarrollo y la gestión administrativa del proyecto."
        },
        "project02" : {
            "title" : "Aplicación CAIH",
            "date" : "15 de Agosto de 2022",
            "shortdescription" : "Sitio web para colegio de arquitectos.",
            "largedescription" : "Aplicación CAIH es un proyecto desarrollado como parte de la práctica para titularme como Técnico Superior Universitario en Tecnologías de la Información (TSU). \n Trabajé en colaboración con otras dos personas, desempeñando un papel de diseñador y administrador de la documentación. \n El objetivo principal fue actualizar una plataforma para el Colegio de Arquitectos e Ingenieros (CAIH), migrando la idea original creada con HTML, CSS y JavaScript a un entorno que emplea frameworks, librerías y servicios en la nube."
        },
        "project03" : {
            "title" : "Dulce Delicia",
            "date" : "28 de Noviembre de 2023",
            "shortdescription" : "Sitio web temático de tienda de dulces.",
            "largedescription" : "Dulce Delicia es un proyecto desarrollado como práctica individual para explorar tecnologías relacionadas con las PWAs (Aplicaciones Web Progresivas), incluyendo Service Workers, archivos de manifiesto, notificaciones y acceso sin conexión. \n Se tomó como referencia un sitio web existente llamado 'Azúcar Dulcerías' para estructurar elementos y contenido."
        },
        "project04" : {
            "title" : "Fashion Fusion",
            "date" : "15 de Agosto de 2023",
            "shortdescription" : "Sitio web temático de tienda de ropa.",
            "largedescription" : "Fashion Fusion es un proyecto desarrollado de forma colaborativa para poner en práctica el versionamiento con Git y GitHub, así como metodologías como DevOps para desarrollar procesos de manera ágil. \n El sitio web tiene una temática de tienda de ropa y todo el contenido fue agregado en menos de una semana, siguiendo técnicas como las ya mencionadas."
        }
    }
}